#  მოცემული 3 მთელი a, b, c ̸= 0 რიცხვებისთვის მოძებნეთ a და b რიცხვებს შორის მოხვედრილი c რიცხვის ჯერადი რიცხვების რაოდენობა ყველა შესაძლო ვარიანტისთვის. თუ რომელიმე a, b-დან ჯერადია c-ს, მაშინ ჩათვალეთ შესაბამისი საზღვარი. მოიფიქრეთ ამოცანის ამოხსნის ალგორითმი, დაწერეთ და გაუშვით პროგრამა ციკლის და რეკურსიის (აგრეთვე range) კონსტრუქციის გამოყენების გარეშე


def func(a, b, c):
    start = (a // c) * c
    end = (b // c) * c 
    
    result = (end - start) // c
    
    if a % c == 0:
        result += 1

    
    return result
    
    
print(func(2,8,2))